### pandas

In [13]:
import pandas as pd
prices = [1000, 1010, 1020]
series1 = pd.Series(prices)
series1

0    1000
1    1010
2    1020
dtype: int64

In [14]:
dates = pd.date_range('20230101', periods = 3)
series2 = pd.Series(prices, index = dates)
series2

2023-01-01    1000
2023-01-02    1010
2023-01-03    1020
Freq: D, dtype: int64

In [15]:
print(pd.date_range('2022-01-01', '2023-01-01', freq = 'M')) #월말
print(pd.date_range('2022-01-01', '2023-01-01', freq = 'MS')) #월초

DatetimeIndex(['2022-01-31', '2022-02-28', '2022-03-31', '2022-04-30',
               '2022-05-31', '2022-06-30', '2022-07-31', '2022-08-31',
               '2022-09-30', '2022-10-31', '2022-11-30', '2022-12-31'],
              dtype='datetime64[ns]', freq='M')
DatetimeIndex(['2022-01-01', '2022-02-01', '2022-03-01', '2022-04-01',
               '2022-05-01', '2022-06-01', '2022-07-01', '2022-08-01',
               '2022-09-01', '2022-10-01', '2022-11-01', '2022-12-01',
               '2023-01-01'],
              dtype='datetime64[ns]', freq='MS')

In [25]:
series2['2023-01-04'] = 1030
series2

2023-01-01    1000
2023-01-02    1010
2023-01-03    1080
2023-01-04    1030
Freq: D, dtype: int64

In [17]:
series2[1:3]

2023-01-02    1010
2023-01-03    1020
Freq: D, dtype: int64

In [18]:
series2[2]
series2['2023-01-03']

1020

In [26]:
series2[2] = 1080
series2

2023-01-01    1000
2023-01-02    1010
2023-01-03    1080
2023-01-04    1030
Freq: D, dtype: int64

## DATAFRAME

In [37]:
prices = {'SK텔레콤' :  [44000, 44500, 45000],
          '삼성전자': [70100, 70200, 70300],
          'LG전자' : [85000, 85500, 86000]}
df1 = pd.DataFrame(prices, index = [1,2,3])
df1.iloc[1,1]

70200

In [38]:
df2 = pd.DataFrame(prices, index = dates)
df2

            SK텔레콤   삼성전자   LG전자
2023-01-01  44000  70100  85000
2023-01-02  44500  70200  85500
2023-01-03  45000  70300  86000

### 데이터 선택
- loc : index, column으로 데이터를 가져온다.
- iloc: 데이터 순서로 데이터를 가져온다.

In [39]:
df2.iloc[0]

SK텔레콤    44000
삼성전자     70100
LG전자     85000
Name: 2023-01-01 00:00:00, dtype: int64

In [ ]:
df2.iloc[:, 0] #row는 전체 모두, column은 첫 번째만
df2.iloc[0,0] #sk텔레콤의 01-01

44000

In [40]:
df2.loc['2023-01-02']
df2.loc[:, 'SK텔레콤']

2023-01-01    44000
2023-01-02    44500
2023-01-03    45000
Freq: D, Name: SK텔레콤, dtype: int64

In [41]:
df2['SK텔레콤']
df2.SK텔레콤
df2['POSCO'] = [450000, 455000, 460000]
df2

            SK텔레콤   삼성전자   LG전자   POSCO
2023-01-01  44000  70100  85000  450000
2023-01-02  44500  70200  85500  455000
2023-01-03  45000  70300  86000  460000

In [ ]:
print(df2.iloc[1:,1:3])

             삼성전자   LG전자
2023-01-02  70200  85500
2023-01-03  70300  86000

             삼성전자   LG전자
2023-01-02  70200  85500
2023-01-03  70300  86000

70200

In [42]:
print(df2.loc['2023-01-02', '삼성전자'])

70200

### 데이터 프레임 확장
- concat : 그냥 가져다 붙이는 거
- merge : 공통된 칼럼이나 인덱스가 있는 경우

In [48]:
s1 = pd.Series([500000, 500500, 501000], name = 'LG화학')

In [49]:
concat_df2 = pd.concat([df2, s1], axis = 1)
concat_df2

                       SK텔레콤     삼성전자     LG전자     POSCO      LG화학
2023-01-01 00:00:00  44000.0  70100.0  85000.0  450000.0       NaN
2023-01-02 00:00:00  44500.0  70200.0  85500.0  455000.0       NaN
2023-01-03 00:00:00  45000.0  70300.0  86000.0  460000.0       NaN
0                        NaN      NaN      NaN       NaN  500000.0
1                        NaN      NaN      NaN       NaN  500500.0
2                        NaN      NaN      NaN       NaN  501000.0

## axis = 1은 열방향으로 값이 나타남(무조건 나타나는 값기준)
## axis = 0은 행방향으로 값이 나타남(무조건 나타나는 값기준)

In [ ]:
concat_df2['LG화학500더하기'] = concat_df2['LG화학'] + 500
concat_df2

            SK텔레콤   삼성전자   LG전자   POSCO    LG화학  LG화학500더하기
2023-01-01  44000  70100  85000  450000  500000      500500
2023-01-02  44500  70200  85500  455000  500500      501000
2023-01-03  45000  70300  86000  460000  501000      501500

In [ ]:
concat_df2.loc['2023-01-06', :] =  [44000, 70100, 85000, 455000, 505000, 550000]
concat_df2

              SK텔레콤     삼성전자     LG전자     POSCO      LG화학  LG화학500더하기
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0    500500.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0    501000.0
2023-01-03  45000.0  70300.0  86000.0  460000.0  501000.0    501500.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0    550000.0

In [ ]:
concat_df2.loc['2023-01-05', :] = concat_df2.loc['2023-01-06'] - 100
concat_df2

              SK텔레콤     삼성전자     LG전자     POSCO      LG화학  LG화학500더하기
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0    500500.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0    501000.0
2023-01-03  45000.0  70300.0  86000.0  460000.0  501000.0    501500.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0    550000.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0    549900.0

In [ ]:
concat_df2.sort_index(ascending=True)

              SK텔레콤     삼성전자     LG전자     POSCO      LG화학  LG화학500더하기
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0    500500.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0    501000.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0    549900.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0    550000.0

In [ ]:
concat_df2.sort_values(by = '삼성전자', ascending=True)

              SK텔레콤     삼성전자     LG전자     POSCO      LG화학  LG화학500더하기
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0    549900.0
2023-01-01  44000.0  70100.0  85000.0  450000.0  500000.0    500500.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0    550000.0
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0    501000.0

In [ ]:
concat_df2.drop('2023-01-01') #inplace를 통해 변수 지정을 하지 않고 그대로 적용시켜줄 수 있음

              SK텔레콤     삼성전자     LG전자     POSCO      LG화학  LG화학500더하기
2023-01-02  44500.0  70200.0  85500.0  455000.0  500500.0    501000.0
2023-01-06  44000.0  70100.0  85000.0  455000.0  505000.0    550000.0
2023-01-05  43900.0  70000.0  84900.0  454900.0  504900.0    549900.0

In [22]:
concat_df2.drop('LG화학500더하기', axis = 1)

NameError: name 'concat_df2' is not defined

In [23]:
concat_df2.drop(['LG화학','LG화학500더하기'], axis = 1)

NameError: name 'concat_df2' is not defined

### 데이터프레임 다루기

In [ ]:
concat_df2['sum'] = concat_df2.sum(axis = 1)
concat_df2

,SK텔레콤,삼성전자,LG전자,POSCO,LG화학,LG화학500더하기,sum
2023-01-01,44000.0,70100.0,85000.0,450000.0,500000.0,500500.0,4948800.0
2023-01-02,44500.0,70200.0,85500.0,455000.0,500500.0,501000.0,4970100.0
2023-01-06,44000.0,70100.0,85000.0,455000.0,505000.0,550000.0,5127300.0
2023-01-05,43900.0,70000.0,84900.0,454900.0,504900.0,549900.0,5125500.0

In [ ]:
concat_df2.min(axis = 0)

SK텔레콤           43900.0
삼성전자            70000.0
LG전자            84900.0
POSCO          450000.0
LG화학           500000.0
LG화학500더하기     500500.0
sum           4948800.0
dtype: float64

In [24]:
concat_df2.describe()

NameError: name 'concat_df2' is not defined

## 결측치 처리
- 제거: dropna
- 대체: fillna, interpolate

In [ ]:
concat_df2.sort_index(inplace= True)

In [ ]:
import numpy as np
concat_df2.loc['2023-01-05', "LG전자":"LG화학"] = np.NaN
concat_df2

,SK텔레콤,삼성전자,LG전자,POSCO,LG화학,LG화학500더하기,sum
2023-01-01,44000.0,70100.0,85000.0,450000.0,500000.0,500500.0,4948800.0
2023-01-02,44500.0,70200.0,85500.0,455000.0,500500.0,501000.0,4970100.0
2023-01-05,43900.0,70000.0,NaN,NaN,NaN,549900.0,5125500.0
2023-01-06,44000.0,70100.0,85000.0,455000.0,505000.0,550000.0,5127300.0

In [ ]:
concat_df2.dropna()

,SK텔레콤,삼성전자,LG전자,POSCO,LG화학,LG화학500더하기,sum
2023-01-01,44000.0,70100.0,85000.0,450000.0,500000.0,500500.0,4948800.0
2023-01-02,44500.0,70200.0,85500.0,455000.0,500500.0,501000.0,4970100.0
2023-01-06,44000.0,70100.0,85000.0,455000.0,505000.0,550000.0,5127300.0

In [ ]:
concat_df2.dropna(axis=1)
concat_df2.fillna(0)
concat_df2.fillna(method = 'bfill')

,SK텔레콤,삼성전자,LG전자,POSCO,LG화학,LG화학500더하기,sum
2023-01-01,44000.0,70100.0,85000.0,450000.0,500000.0,500500.0,4948800.0
2023-01-02,44500.0,70200.0,85500.0,455000.0,500500.0,501000.0,4970100.0
2023-01-05,43900.0,70000.0,85000.0,455000.0,505000.0,549900.0,5125500.0
2023-01-06,44000.0,70100.0,85000.0,455000.0,505000.0,550000.0,5127300.0

In [ ]:
concat_df3 = concat_df2.copy()
concat_df4 = pd.concat([concat_df2, concat_df3])
concat_df4

,SK텔레콤,삼성전자,LG전자,POSCO,LG화학,LG화학500더하기,sum
2023-01-01,44000.0,70100.0,85000.0,450000.0,500000.0,500500.0,4948800.0
2023-01-02,44500.0,70200.0,85500.0,455000.0,500500.0,501000.0,4970100.0
2023-01-05,43900.0,70000.0,NaN,NaN,NaN,549900.0,5125500.0
2023-01-06,44000.0,70100.0,85000.0,455000.0,505000.0,550000.0,5127300.0
2023-01-01,44000.0,70100.0,85000.0,450000.0,500000.0,500500.0,4948800.0
2023-01-02,44500.0,70200.0,85500.0,455000.0,500500.0,501000.0,4970100.0
2023-01-05,43900.0,70000.0,NaN,NaN,NaN,549900.0,5125500.0
2023-01-06,44000.0,70100.0,85000.0,455000.0,505000.0,550000.0,5127300.0

In [ ]:
concat_df2.interpolate() #중간값을 채우는 함수
concat_df4.drop_duplicates()
concat_df2.loc['2023-01-03', :] = concat_df2.loc['2023-01-06', :].copy()
concat_df2.sort_index(inplace=True)
concat_df2

concat_df2.drop_duplicates
idx = concat_df2['삼성전자'].drop_duplicates().index #인덱스 기준으로 데이터를 가져오는 것이 많다
concat_df2.loc[idx, :]

,SK텔레콤,삼성전자,LG전자,POSCO,LG화학,LG화학500더하기,sum
2023-01-01,44000.0,70100.0,85000.0,450000.0,500000.0,500500.0,4948800.0
2023-01-02,44500.0,70200.0,85500.0,455000.0,500500.0,501000.0,4970100.0
2023-01-05,43900.0,70000.0,NaN,NaN,NaN,549900.0,5125500.0

In [58]:
#1
q1 = pd.date_range('2022-01-01','2022-12-01', freq = 'MS')

#2
gab = {'value': [1,2,3,4,5,6,7,8,9,10,11,12]}
dfd = pd.DataFrame(gab, index = q1)

concat_dfd['value_add_100'] = concat_dfd['value'] + 100
concat_dfd

concat_dfd.drop('2022-09-01', axis = 0)

            value  LG화학  value_add_100
2022-01-01      1     0            101
2022-02-01      2     0            102
2022-03-01      3     0            103
2022-04-01      4     0            104
2022-05-01      5     0            105
2022-06-01      6     0            106
2022-07-01      7     0            107
2022-08-01      8     0            108
2022-10-01     10     0            110
2022-11-01     11     0            111
2022-12-01     12     0            112